package com.overview;
    /*
1、
    1.java规范的三种注释方式：
    单行注释
    多行注释
    文档注释(java特有)

    2.
    单行注释和多行注释的作用:
        1、对所写的程序进行解释说明，增强可读性
        2、调试所写的代码

    3.特点:单行注释和多行注释，注释的内容不参与编译。

    4.文档注释的使用:
        注释内容可以被JDK提供的工具 javadoc 所解析，生成一套以网页文件形式体现的该程序的说明文档。
        操作方式:
            1、在该代码所在文件夹的命令行界面下-javadoc -d 文件名 -author -version 文件名称.java
            2、打开文件名->点击index.html

    5.多行注释不可以嵌套使用
     */

    /**
     * 文档注释
     * @author shkstart
     * @version v1.0
     * 这是我的第一个java程序!
     */

public class Annotation {
    //单行注释

    /*
    多行注释
    多行注释
     */

    /**
     * 文档注释
     */
}
