package com.overview;

/*
3、
    1、Java对各种变量、方法和类等要素命名时使用的字符序列称为标识符。
    2、技巧：凡是自己可以起名字的地方都叫标识符。
    3、定义合法标识符规则：
    由26个英文字母大小写，0-9，_或$组成
    数字不可以开头。
    不可以使用关键字和保留字，但能包含关键字和保留字。
    Java中严格区分大小写，长度无限制。
    标识符不能包含空格。
    4、Java中的名称命名规范：
    包名：多单词组成时所有字母都小写：xxxyyyzzz
    类名、接口名多单词组成时，所有单词的首字母大写：XxxYyyZzz
    变量名、方法名：多单词组成时，第一个单词首字母小写，第二个单词开始每个单词首字母大写：xxxYyyZzz
    常量名：所有字母都大写。多单词时每个单词用下划线连接：XXX_YYY_ZZZ
    1.类，方法的注释，使用javadoc的方式，即文档注释
    2.非javadoc注释，往往是对代码的说明（给程序的维护者），说明如何修改，注意事项
    3.使用tab，整体将代码右移，使用shift+tab 整体左移
    4.运算符和 = 的两边，给空格，代码看上去清楚
    5.源码文件使用utf-8编码
    6.行宽字符不要超过80
    7.代码编程风格有两种 次行风格和行尾风格（推荐行尾）

    注意1：在起名字时，为了提高阅读性，要尽量有意义，“见名知意”。
    注意2：java采用unicode字符集，因此标识符也可以使用汉字声明，但是不建议使用。

 */
public class Identifier {
}